Relacion/app/controllers/alumnos_controller.rb

SELECT "alumnos".* FROM "alumnos"
---
  def index
    @alumnos = Alumno.all

INSERT INTO "alumnos" ("nombre", "apellido", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "Daniel"], ["apellido", "Torres"], ["created_at", "2016-06-07 21:25:40.520970"], ["updated_at", "2016-06-07 21:25:40.520970"]]
---
  def create
    @alumno = Alumno.new(alumno_params)

    respond_to do |format|
      if @alumno.save

SELECT  "alumnos".* FROM "alumnos" WHERE "alumnos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_alumno
      @alumno = Alumno.find(params[:id])