Relacion/app/controllers/asignaturas_controller.rb

  def index
    @asignaturas = Asignatura.all
---
SELECT "asignaturas".* FROM "asignaturas"

  def create
    @asignatura = Asignatura.new(asignatura_params)

    respond_to do |format|
      if @asignatura.save
---
INSERT INTO "asignaturas" ("nombre", "horas", "alumno_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Historia"], ["horas", 6], ["alumno_id", 0], ["created_at", "2016-06-07 21:26:51.105382"], ["updated_at", "2016-06-07 21:26:51.105382"]]

  def update
    respond_to do |format|
      if @asignatura.update(asignatura_params)
---
UPDATE "asignaturas" SET "nombre" = ?, "alumno_id" = ?, "updated_at" = ? WHERE "asignaturas"."id" = ?  [["nombre", "español"], ["alumno_id", 0], ["updated_at", "2016-06-07 21:30:02.037631"], ["id", 2]]

    def set_asignatura
      @asignatura = Asignatura.find(params[:id])
---
SELECT  "asignaturas".* FROM "asignaturas" WHERE "asignaturas"."id" = ? LIMIT 1  [["id", 1]]